
public class ATMInterface {

	void dataCardInput(){	//повторяется с другим интерфейсом, нормально или что-то предпринять?
	}
	void pinInput(){	//повторяется с другим интерфейсом, нормально или что-то предпринять?
	}
	void sumOfOperationInput(){	//повторяется с другим интерфейсом, нормально или что-то предпринять?
	}
	void payment(){
	}
	void checkPrinting(){	//повторяется с другим интерфейсом, нормально или что-то предпринять?
	}
	void authorizationRequest(){	//повторяется с другим интерфейсом, нормально или что-то предпринять?
	}
	void receivingProcessingOfAnswer(){	//повторяется с другим интерфейсом, нормально или что-то предпринять?
	}
	
}
